NO_FLOOD_LINK_HTML = '<a href="...">Phystech.No Flood</a>'


CHATS = '''
Чат всех физтехов: .......

Python: @........
Kotlin: @........
C++: @........
'''


SERVICES = '''
Купоны на пиццу: @.........
'''

COUNTRIES = '''
<a href="...">🌍 Физтех.Релокация</a>
'''

BLOGS = '''
Kostin: .....
IT Hustler: .......
'''

ASK_FOR_EMAIL = '''
Давай удостоверимся, что ты из МФТИ. \
Hапиши свою почту на домене <code>@phystech.edu</code>, \
и мы вышлем на неё секретный код 😉

Если у тебя нет почты на домене <code>@phystech.edu</code>, \
то напиши в <a href="...">чат поддержки</a>
'''