NO_FLOOD_RULES = '''
💼 Чат предназначен только для лиц, связанных с МФТИ: \
обучающихся, выпускников, преподавателей и работников
🆕 Для добавления новых участников писать @phystech_bot
...
...
'''


CHATS = '''
Python: @........
Kotlin: @........
C++: @........
'''


SERVICES = '''
Бонусные карты: @.........
'''


BLOGS = '''
Kostin: .....
IT Hustler: .......
'''

ASK_FOR_EMAIL = '''
Давай удостоверимся, что ты из МФТИ. \
Hапиши свою почту на домене <code>@phystech.edu</code>, \
и мы вышлем на неё секретный код 😉

Если у тебя нет почты на домене <code>@phystech.edu</code>, \
то напиши в <a href="...">чат поддержки</a>
'''